{"pageProps":{"footer":{"menus":[]},"page":{"id":"cG9zdDo0NTc=","title":"Terms of service","slug":"terms-of-service","uri":"/terms-of-service/","content":"\n<div class=\"wp-block-columns is-layout-flex wp-container-core-columns-is-layout-1 wp-block-columns-is-layout-flex\">\n<div class=\"wp-block-column is-layout-flow wp-block-column-is-layout-flow\">\n<h2 class=\"wp-block-heading\">1. <strong>Your Acceptance</strong></h2>\n\n\n\n<ol class=\"wp-block-list\">\n<li>By using and/or visiting this website (collectively, including all content and functionality available through the bookmyparty.co.in the domain name, the ” BookMyParty Website”, or “Website”), you signify your agreement to&nbsp;<strong>(1) these terms and conditions (the “Terms of Service”)&nbsp;</strong>and&nbsp;<strong>(2) BookMyParty ‘s privacy notice</strong>, found at&nbsp;<a href=\"https://www.bookmyparty.co.in/privacy-policy\">https://www.bookmyparty.co.in/privacy-policy</a>&nbsp;and incorporated here by reference. If you do not agree to any of these terms, the BookMyParty privacy notice, please do not use the BookMyParty Website www.bookmyparty.co.in</li>\n\n\n\n<li>Although we may attempt to notify you when major changes are made to these Terms of Service, you should periodically review the most up-to-date version&nbsp;<a href=\"https://www.bookmyparty.co.in/terms-service\">https://www.bookmyparty.co.in/terms-service</a>. BookMyParty may, in its sole discretion, modify or revise these Terms of Service and policies at any time, and you agree to be bound by such modifications or revisions. Nothing in this Agreement shall be deemed to confer any third-party rights or benefits.</li>\n\n\n\n<li>BookMyParty is entitled to assign this agreement, and all rights and obligations hereunder, to a successor to all or any of its assets, whether by sale, merger or otherwise. These terms shall be binding upon and shall inure to the benefit of the parties hereto and their respective representatives, heirs, administrators, successors and permitted assigns except as otherwise provided herein.</li>\n</ol>\n</div>\n</div>\n\n\n\n<div class=\"wp-block-columns is-layout-flex wp-container-core-columns-is-layout-2 wp-block-columns-is-layout-flex\">\n<div class=\"wp-block-column is-layout-flow wp-block-column-is-layout-flow\">\n<h3 class=\"wp-block-heading\"><strong>2. BookMyParty Website</strong></h3>\n\n\n\n<ol class=\"wp-block-list\">\n<li>These Terms of Service apply to all users of the BookMyParty Website, including users who are also contributors of content, information, and other materials or services on the Website. The BookMyParty Website includes all aspects of BookMyParty, including but not limited to all products, software and services offered via the website.</li>\n\n\n\n<li>The BookMyParty Website may contain links to third-party websites that are not owned or controlled by BookMyParty. BookMyParty has no control over and assumes no responsibility for, the content, privacy policies, or practices of any third-party websites. In addition, BookMyParty will not and cannot censor or edit the content of any third-party site. By using the Website, you expressly indemnify and relieve BookMyParty from any and all liability arising from your use of any third-party website.</li>\n\n\n\n<li>Accordingly, we encourage you to be aware when you leave the BookMyParty Website and to read the terms and conditions and privacy policy of each other website that you visit.</li>\n</ol>\n</div>\n</div>\n\n\n\n<div class=\"wp-block-columns is-layout-flex wp-container-core-columns-is-layout-3 wp-block-columns-is-layout-flex\">\n<div class=\"wp-block-column is-layout-flow wp-block-column-is-layout-flow\">\n<h3 class=\"wp-block-heading\"><strong>3. BookMyParty Accounts</strong></h3>\n\n\n\n<ol class=\"wp-block-list\">\n<li>In order to access some features of the Website, you will have to create a BookMyParty account. You may never use another’s account without permission. When creating your account, you must provide accurate and complete information. You are solely responsible for the activity that occurs on your account, and you must keep your account password secure. You must notify BookMyParty immediately of any breach of security or unauthorized use of your account.</li>\n\n\n\n<li>We reserve the right to charge a fee at any time as deemed appropriate by us for the services provided on book party.co.in.</li>\n\n\n\n<li>Although BookMyParty will not be liable for your losses caused by any unauthorized use of your account, you may be liable for the losses of BookMyParty or others due to such unauthorized use.</li>\n</ol>\n</div>\n</div>\n\n\n\n<div class=\"wp-block-columns is-layout-flex wp-container-core-columns-is-layout-4 wp-block-columns-is-layout-flex\">\n<div class=\"wp-block-column is-layout-flow wp-block-column-is-layout-flow\">\n<h4 class=\"wp-block-heading\"><strong>4. General Use of the Website- Permissions and Restrictions</strong></h4>\n\n\n\n<p>BookMyParty hereby grants you permission to access and use the Website as set forth in these Terms of Service, provided that:</p>\n\n\n\n<ol class=\"wp-block-list\">\n<li>You agree not to distribute in any medium any part of the Website, including but not limited to User Submissions (defined below), without BookMyParty’s prior written authorization.</li>\n\n\n\n<li>You agree not to alter or modify any part of the Website.</li>\n\n\n\n<li>You agree not to access User Submissions (defined below) or BookMyParty Content through any technology or means.</li>\n\n\n\n<li>You agree not to use the Website for any commercial use, without the prior written authorization of BookMyParty.<br>Prohibited commercial uses include any of the following actions taken without BookMyParty’s express approval:\n<ol class=\"wp-block-list\">\n<li>sale of access to the Website or its related services on another website;</li>\n\n\n\n<li>use of the Website or its related services, for the primary purpose of gaining advertising or subscription revenue;</li>\n\n\n\n<li>the sale of advertising, on the BookMyParty website or any third-party website, targeted to the content of specific User Submissions or BookMyParty content;</li>\n</ol>\n</li>\n</ol>\n\n\n\n<p>and any use of the Website or its related services that BookMyParty finds, in its sole discretion, to use BookMyParty’s resources or User Submissions with the effect of competing with or displacing the market for BookMyParty, BookMyParty content, or its User Submissions.<br>Prohibited commercial uses do not include:</p>\n\n\n\n<ol class=\"wp-block-list\">\n<li>uploading original information to BookMyParty or maintaining an original webpage on BookMyParty, to promote your business enterprise;</li>\n\n\n\n<li>any use that BookMyParty expressly authorizes in writing.</li>\n</ol>\n\n\n\n<p>You agree not to use or launch any automated system, including without limitation, “robots,” “spiders,” or “offline readers,” that accesses the Website in a manner that sends more request messages to the BookMyParty servers in a given period of time than a human can reasonably produce in the same period by using a conventional on-line web browser. Notwithstanding the foregoing, BookMyParty grants the operators of public search engines permission to use spiders to copy materials from the site for the sole purpose of and solely to the extent necessary for creating publicly available searchable indices of the materials, but not caches or archives of such materials. BookMyParty reserves the right to revoke these exceptions either generally or in specific cases. You agree not to collect or harvest any personally identifiable information, including account names, from the Website, nor to use the communication systems provided by the Website (e.g. comments, email) for any commercial solicitation purposes.<br>In your use of the website, you will otherwise comply with the terms and conditions of these Terms of Service, and all applicable local, national, and international laws and regulations.<br>BookMyParty reserves the right to discontinue any aspect of the BookMyParty Website at any time.</p>\n</div>\n</div>\n\n\n\n<div class=\"wp-block-columns is-layout-flex wp-container-core-columns-is-layout-5 wp-block-columns-is-layout-flex\">\n<div class=\"wp-block-column is-layout-flow wp-block-column-is-layout-flow\">\n<h4 class=\"wp-block-heading\"><strong>5. Your Use of Content on the Site</strong></h4>\n\n\n\n<p>In addition to the general restrictions above, the following restrictions and conditions apply specifically to your use of the content on the BookMyParty Website.</p>\n\n\n\n<ol class=\"wp-block-list\">\n<li>The content on the BookMyParty Website, except all User Submissions (as defined below), including without limitation, the text, software, scripts, graphics, photos, sounds, music, videos, interactive features and the like (“Content”) and the trademarks, service marks and logos contained therein (“Marks”), are owned by or licensed to BookMyParty, subject to copyright and other intellectual property rights under the law. Content on the Website is provided to you AS IS for your information and personal use only and may not be downloaded, copied, reproduced, distributed, transmitted, broadcast, displayed, sold, licensed, or otherwise exploited for any other purposes whatsoever without the prior written consent of the respective owners. BookMyParty reserves all rights not expressly granted in and to the Website and the Content.</li>\n\n\n\n<li>You may access User Submissions for your information and personal use solely as intended through the provided functionality of the BookMyParty Website. You shall not copy or download any User Submission unless you see a “download” or similar link displayed by BookMyParty on the BookMyParty Website for that User Submission.</li>\n\n\n\n<li>User Comments are made available to you for your information and personal use solely as intended through the normal functionality of the BookMyParty Website. User Comments are made available “as is”, and may not be used, copied, reproduced, distributed, transmitted, broadcast, displayed, sold, licensed, downloaded, or otherwise exploited in any manner not intended by the normal functionality of the BookMyParty Website or otherwise as prohibited under this Agreement.</li>\n\n\n\n<li>You may access BookMyParty Content, User Submissions, and other content only as permitted under this Agreement. BookMyParty reserves all rights not expressly granted in and to the BookMyParty Content and the BookMyParty Website.</li>\n\n\n\n<li>You agree to not engage in the use, copying, or distribution of any of the Content other than expressly permitted herein, including any use, copying, or distribution of User Submissions of third parties obtained through the Website for any commercial purposes.</li>\n\n\n\n<li>You agree not to circumvent, disable or otherwise interfere with security-related features of the BookMyParty Website or features that prevent or restrict the use or copying of any Content or enforce limitations on use of the BookMyParty Website or the Content therein.</li>\n\n\n\n<li>You understand that when using the BookMyParty Website, you will be exposed to User Submissions from a variety of sources and that BookMyParty is not responsible for the accuracy, usefulness, safety, or intellectual property rights of or relating to such User Submissions. You further understand and acknowledge that you may be exposed to User Submissions that are inaccurate, offensive, indecent, or objectionable, and you agree to waive, and hereby do waive, any legal or equitable rights or remedies you have or may have against BookMyParty with respect thereto, and agree to indemnify and hold BookMyParty, its Owners/Operators, affiliates, and/or licensors, harmless to the fullest extent allowed by law regarding all matters related to your use of the site.</li>\n</ol>\n</div>\n</div>\n\n\n\n<div class=\"wp-block-columns is-layout-flex wp-container-core-columns-is-layout-6 wp-block-columns-is-layout-flex\">\n<div class=\"wp-block-column is-layout-flow wp-block-column-is-layout-flow\">\n<h4 class=\"wp-block-heading\"><strong>6. Your User Submissions and Conduct</strong></h4>\n\n\n\n<ol class=\"wp-block-list\">\n<li>As a BookMyParty account holder you may submit, business information (User Business Information), Photo &amp; Video content (“User Photos &amp; Videos”), and textual content (“User Comments”) , collectively referred to as “User Submissions.” You understand that whether or not such User Submissions are published, BookMyParty does not guarantee any confidentiality with respect to any User Submissions.</li>\n\n\n\n<li>You shall be solely responsible for your own User Submissions and the consequences of posting or publishing them. In connection with User Submissions, you affirm, represent, and/or warrant that: you own or have the necessary licenses, rights, consents, and permissions to use and authorize BookMyParty to use all patent, trademark, trade secret, copyright or other proprietary rights in and to any and all User Submissions to enable inclusion and use of the User Submissions in the manner contemplated by the Website and these Terms of Service.</li>\n\n\n\n<li>For clarity, you retain all of your ownership rights in your User Submissions. However, by submitting User Submissions to BookMyParty, you hereby grant BookMyParty a worldwide, non-exclusive, royalty-free, sublicensable, and transferable license to use, reproduce, distribute, prepare derivative works of, display, and perform the User Submissions in connection with the BookMyParty Website and BookMyParty’s (and its successors’ and affiliates’) business, including without limitation for promoting and redistributing part or all of the BookMyBanquet Website (and derivative works thereof) in any media formats and through any media channels. You also hereby grant each user of the BookMyParty Website a non-exclusive license to access your User Submissions through the Website, and to use, reproduce, distribute, display and perform such User Submissions as permitted through the functionality of the Website and under these Terms of Service. The above licenses granted by you in User Business Information terminate within a commercially reasonable time after you remove or delete your Business Information from the BookMyParty Website. You understand and agree, however, that BookMyParty may retain, but not display, distribute, or perform, server copies of User Submissions that have been removed or deleted. The above licenses granted by you in User Comments are perpetual and irrevocable.</li>\n\n\n\n<li>In connection with User Submissions, you further agree that you will not submit material that is copyrighted, protected by trade secret, or otherwise subject to third-party proprietary rights, including privacy and publicity rights, unless you are the owner of such rights or have permission from their rightful owner to post the material and to grant BookMyParty all of the license rights granted herein.</li>\n\n\n\n<li>BookMyParty does not endorse any User Submission or any opinion, recommendation, or advice expressed therein, and BookMyParty expressly disclaims any and all liability in connection with User Submissions. BookMyParty does not permit copyright infringing activities and infringement of intellectual property rights on its Website, and BookMyParty will remove all Content and User Submissions if properly notified that such Content or User Submission infringes on another’s intellectual property rights. BookMyParty reserves the right to remove Content and User Submissions without prior notice.</li>\n</ol>\n</div>\n</div>\n\n\n\n<div class=\"wp-block-columns is-layout-flex wp-container-core-columns-is-layout-7 wp-block-columns-is-layout-flex\">\n<div class=\"wp-block-column is-layout-flow wp-block-column-is-layout-flow\">\n<h4 class=\"wp-block-heading\"><strong>7. Account Termination Policy</strong></h4>\n\n\n\n<ol class=\"wp-block-list\">\n<li>BookMyParty will terminate a User’s access to its Website if, under appropriate circumstances, they are determined to be a repeat infringer.</li>\n\n\n\n<li>BookMyParty reserves the right to decide whether Content or a User Submission is appropriate and complies with these Terms of Service for violations other than copyright infringement, such as, but not limited to, pornography, obscene or defamatory material, or excessive length. BookMyParty may remove such User Submissions and/or terminate a User’s access for uploading such material in violation of these Terms of Service at any time, without prior notice and at its sole discretion.</li>\n</ol>\n</div>\n</div>\n\n\n\n<div class=\"wp-block-columns is-layout-flex wp-container-core-columns-is-layout-8 wp-block-columns-is-layout-flex\">\n<div class=\"wp-block-column is-layout-flow wp-block-column-is-layout-flow\">\n<h4 class=\"wp-block-heading\"><strong>8. Digital Millennium Copyright Act</strong></h4>\n\n\n\n<ol class=\"wp-block-list\">\n<li>If you are a copyright owner or an agent thereof and believe that any User Submission or other content infringes upon your copyrights, you may submit a notification pursuant to the Digital Millennium Copyright Act (“DMCA”) by providing our Copyright Agent with the following information in writing (see 17 U.S.C 512(c)(3) for further detail):</li>\n</ol>\n\n\n\n<ul class=\"wp-block-list\">\n<li>A physical or electronic signature of a person authorized to act on behalf of the owner of an exclusive right that is allegedly infringed;</li>\n\n\n\n<li>Identification of the copyrighted work claimed to have been infringed, or, if multiple copyrighted works at a single online site are covered by a single notification, a representative list of such works at that site;</li>\n\n\n\n<li>Identification of the material that is claimed to be infringing or to be the subject of infringing activity and that is to be removed or access to which is to be disabled and information reasonably sufficient to permit the service provider to locate the material;</li>\n\n\n\n<li>Information reasonably sufficient to permit the service provider to contact you, such as an address, telephone number, and, if available, an electronic mail;</li>\n\n\n\n<li>A statement that you have a good faith belief that use of the material in the manner complained of is not authorized by the copyright owner, its agent, or the law; and</li>\n\n\n\n<li>A statement that the information in the notification is accurate, and under penalty of perjury, that you are authorized to act on behalf of the owner of an exclusive right that is allegedly infringed.</li>\n</ul>\n\n\n\n<p>To report infringement email:<a href=\"mailto:copyright@bookmyparty.co.in.\">copyright@bookmyparty.co.in.</a></p>\n</div>\n</div>\n\n\n\n<div class=\"wp-block-columns is-layout-flex wp-container-core-columns-is-layout-9 wp-block-columns-is-layout-flex\">\n<div class=\"wp-block-column is-layout-flow wp-block-column-is-layout-flow\">\n<h4 class=\"wp-block-heading\"><strong>9. Warranty Disclaimer</strong></h4>\n\n\n\n<p>You Agree That Your Use of the Bookmyparty Website Shall Be at Your Sole Risk. To the Fullest Extent Permitted by Law, Bookmyparty, Its Officers, Directors, Employees, and Agents Disclaim All Warranties, Express or Implied, in Connection with the Website and Your Use Thereof. Bookmyparty Makes No Warranties or Representations about the Accuracy or Completeness of This Site’s Content or the Content of Any Sites Linked to This Site and Assumes No Liability or Responsibility for Any</p>\n\n\n\n<p>(I) Errors, Mistakes, or Inaccuracies of Content,</p>\n\n\n\n<p>(Ii) Personal Injury or Property Damage, of Any Nature Whatsoever, Resulting from Your Access to and Use of Our Website,</p>\n\n\n\n<p>(Iii) Any Unauthorized Access to or Use of Our Secure Servers And/Or Any and All Personal Information And/Or Financial Information Stored Therein,</p>\n\n\n\n<p>(Iv) Any Interruption or Cessation of Transmission to or from Our Website,</p>\n\n\n\n<p>(Iv) Any Bugs, Viruses, Trojan Horses, or the like Which May Be Transmitted to or Through Our Website by Any Third Party, And/Or</p>\n\n\n\n<p>(V) Any Errors or Omissions in Any Content or for Any Loss or Damage of Any Kind Incurred as a Result of the Use of Any Content Posted, Emailed, Transmitted, or Otherwise Made Available via the Bookmyparty Website.</p>\n\n\n\n<p>Bookmyparty Does Not Warrant, Endorse, Guarantee, or Assume Responsibility for Any Product or Service Advertised or Offered by a Third Party Through the Bookmyparty Website or Any Hyperlinked Website or Featured in Any Banner or Other Advertising, and Bookmyparty Will Not Be a Party to or in Any Way Be Responsible for Monitoring Any Transaction Between You and Third-party Providers of Products or Services.</p>\n\n\n\n<p>As with the Purchase of a Product or Service Through Any Medium or in Any Environment, You Should Use Your Best Judgment and Exercise Caution Where Appropriate. 10. Limitation of Liability In No Event Shall Bookmyparty, Its Officers, Directors, Employees, or Agents, Be Liable to You for Any Direct, Indirect, Incidental, Special, Punitive, or Consequential Damages Whatsoever Resulting from Any</p>\n\n\n\n<p>(I) Errors, Mistakes, or Inaccuracies of Content,</p>\n\n\n\n<p>(Ii) Personal Injury or Property Damage, of Any Nature Whatsoever, Resulting from Your Access to and Use of Our Website,</p>\n\n\n\n<p>(Iii) Any Unauthorized Access to or Use of Our Secure Servers And/Or Any and All Personal Information And/Or Financial Information Stored Therein,</p>\n\n\n\n<p>(Iv) Any Interruption or Cessation of Transmission to or from Our Website,</p>\n\n\n\n<p>(Iv) Any Bugs, Viruses, Trojan Horses, or the like, Which May Be Transmitted to or Through Our Website by Any Third Party, And/Or</p>\n\n\n\n<p>(V) Any Errors or Omissions in Any Content or for Any Loss or Damage of Any Kind Incurred as a Result of Your Use of Any Content Posted, Emailed, Transmitted, or Otherwise Made Available via the Bookmyparty Website, Whether Based on Warranty, Contract, Tort, or Any Other Legal Theory, and Whether or Not the Company Is Advised of the Possibility of Such Damages. The foregoing Limitation of Liability Shall Apply to the Fullest Extent Permitted by Law in the Applicable Jurisdiction.</p>\n\n\n\n<p>You Specifically Acknowledge That Bookmyparty Shall Not Be Liable for User Submissions or the Defamatory, Offensive, or Illegal Conduct of Any Third Party and That the Risk of Harm or Damage from the Foregoing Rests Entirely with You.</p>\n\n\n\n<p>The Website is controlled and offered by BookMyParty from its facilities in India. BookMyParty makes no representations that the BookMyParty Website is appropriate or available for use in other locations. Those who access or use the BookMyParty Website from other jurisdictions do so at their own volition and are responsible for compliance with local law.</p>\n</div>\n</div>\n\n\n\n<div class=\"wp-block-columns is-layout-flex wp-container-core-columns-is-layout-10 wp-block-columns-is-layout-flex\">\n<div class=\"wp-block-column is-layout-flow wp-block-column-is-layout-flow\">\n<h4 class=\"wp-block-heading\"><strong>11. Indemnity</strong></h4>\n\n\n\n<p>You agree to defend, indemnify and hold harmless BookMyParty, its parent company, officers, directors, employees and agents, from and against any and all claims, damages, obligations, losses, liabilities, costs or debt, and expenses (including but not limited to attorney’s fees) arising from: (i) your use of and access to the BookMyParty Website; (ii) your violation of any term of these Terms of Service; (iii) your violation of any third party right, including without limitation any copyright, property, or privacy right; or (iv) any claim that one of your User Submissions caused damage to a third party. This defense and indemnification obligation will survive these Terms of Service and your use of the BookMyParty Website.</p>\n</div>\n</div>\n\n\n\n<div class=\"wp-block-columns is-layout-flex wp-container-core-columns-is-layout-11 wp-block-columns-is-layout-flex\">\n<div class=\"wp-block-column is-layout-flow wp-block-column-is-layout-flow\">\n<h4 class=\"wp-block-heading\"><strong>12. Ability to Accept Terms of Service</strong></h4>\n\n\n\n<p>You affirm that you are either more than 18 years of age, or an emancipated minor, or possess legal parental or guardian consent, and are fully able and competent to enter into the terms, conditions, obligations, affirmations, representations, and warranties set forth in these Terms of Service, and to abide by and comply with these Terms of Service. In any case, you affirm that you are over the age of 13, as the BookMyParty Website is not intended for children under 13. If you are under 13 years of age, then please do not use the BookMyParty Website.</p>\n</div>\n</div>\n\n\n\n<div class=\"wp-block-columns is-layout-flex wp-container-core-columns-is-layout-12 wp-block-columns-is-layout-flex\">\n<div class=\"wp-block-column is-layout-flow wp-block-column-is-layout-flow\">\n<h4 class=\"wp-block-heading\"><strong>13. Assignment</strong></h4>\n\n\n\n<p>These Terms of Service, and any rights and licenses granted hereunder, may not be transferred or assigned by you, but may be assigned by BookMyParty without restriction.</p>\n</div>\n</div>\n\n\n\n<div class=\"wp-block-columns is-layout-flex wp-container-core-columns-is-layout-13 wp-block-columns-is-layout-flex\">\n<div class=\"wp-block-column is-layout-flow wp-block-column-is-layout-flow\">\n<h4 class=\"wp-block-heading\"><strong>14. Governing Law and Jurisdiction</strong></h4>\n\n\n\n<p>The Terms of Use and any action related hereto shall be governed by the laws of India without reference to the conflict of provisions of law thereof. BookMyParty and You hereby agree on behalf of yourselves and any person claiming by or through You that the sole and exclusive jurisdiction and venue for any litigation arising from or relating to the Terms of Use or the subject matter hereof shall be adjudicated at an appropriate court located in New Delhi, India.</p>\n</div>\n</div>\n","contentTypeName":"page","seo":{"title":"Our Terms & Services - Book My Party","metaDesc":"Chеck out our tеrms of sеrvicе pagе hеrе, for a sеamlеss еvеnt planning еxpеriеncе. Discovеr guidеlinеs еnsuring your cеlеbration day is strеss-frее and mеmorablе."},"template":{"templateName":"Default"}},"pageBuilder":{"id":"cG9zdDo0NTc=","seo":{"title":"Our Terms & Services - Book My Party","metaDesc":"Chеck out our tеrms of sеrvicе pagе hеrе, for a sеamlеss еvеnt planning еxpеriеncе. Discovеr guidеlinеs еnsuring your cеlеbration day is strеss-frее and mеmorablе."},"pageBuilder":{"pageLayout":null}}},"__N_SSG":true}